app/views/gossip/edit.html.erb


<p class="text-left">le potin de <%= link_to Gossip.find(the_id.to_i).user.first_name, user_path(Gossip.find(the_id.to_i).user.id)%> est édité.</p>
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 43], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]

    <%= label_tag 'Title', nil, :class => "" %>
    <%= text_field_tag 'title', nil, value: Gossip.find(the_id.to_i).title, :class => "form-control" %>
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 43], ["LIMIT", 1]]

    <%= label_tag 'Content', nil, :class => "" %>
    <%= text_field_tag 'content', nil, value: Gossip.find(the_id.to_i).content, :class => "form-control"  %>
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 43], ["LIMIT", 1]]