app/views/gossip/show.html.erb

      <div class="card-text">
        <p><strong>Son auteur : </strong><%= Gossip.find(the_id.to_i).user.first_name %></p>
        <p><strong>Le contenu du potin : </strong><%= Gossip.find(the_id.to_i).content %></p>
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]