app/views/static/index.html.erb

<div class="cards">
  <% Gossip.all.each do |gossip| %>
---
SELECT "gossips".* FROM "gossips"


        <h5 class="card-subtitle m-3 text-muted">Gossip n°<%= Gossip.all.index(gossip) + 1 %>, de <%= gossip.user.first_name %></h5>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "gossips".* FROM "gossips"