app/controllers/gossip_controller.rb

SELECT  "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT $1  [["LIMIT", 1]]
---
  def new_gossip
    @gossip = Gossip.new(title: "", content: "", user: User.last)

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
INSERT INTO "gossips" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Test potin"], ["content", "Nouveau contenu de blabla"], ["user_id", 11], ["created_at", "2020-05-07 14:13:21.535438"], ["updated_at", "2020-05-07 14:13:21.535438"]]
---
  def create
    @gossip = Gossip.new(title: params[:title],
                         content: params[:content],
                         user: User.find(params[:user]))

    if @gossip.save

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."title" IS NULL LIMIT $1  [["LIMIT", 1]]
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def update
	@gossip = Gossip.find_by(title: params[:title])

    if @gossip.update(title: params[:title], content: params[:content], user: User.find(params[:user]))